# ДЗ
# Составить список из 5 текстовых значений (тип данных string).
# Вывести на консоль каждую первую букву каждого элемента списка.
# Подсказка: нужно будет ставить две пары квадратных скобок (data[][]).

menu = ['Пельмени', 'Паста', 'Картошка', 'Мясо', 'Рыба']
print(menu[0][0])
print(menu[1][0])
print(menu[2][0])
print(menu[3][0])
print(menu[4][0])
