print("Hello Word!")
print("Привет Мир!")

print(2023)
print(input())

# ДЗ
# Написать программу, которая выведет в консоль анкету.
# Пусть анкета состоит из:
# ФИО
# Возраст и дата рождения
# Цвет волос
# Рост
# Любимая еда

print(input('Введите ФИО: '))
print(input('Введите возраст и дату рождения: '))
print(input('Укажите свой цвет волос: '))
print(input('Укажите свой рост: '))
print(input('Какая ваша любимая еда? '))
