# ДЗ
# Написать программу, которая спросит у пользователя и выведет в консоль анкету.
# Пусть анкета состоит из:
# ФИО
# Возраст и дата рождения
# Цвет волос
# Рост
# Любимая еда

print(input('Введите ФИО: '))
print(input('Введите возраст и дату рождения: '))
print(input('Укажите свой цвет волос: '))
print(input('Укажите свой рост: '))
print(input('Какая ваша любимая еда? '))
