# ДЗ
# Написать программу, которая спросит у пользователя 10 различных вопросов и выведет ответы на экран.

print(input('Как вас зовут? '))
print(input('Сколько вам лет? '))
print(input('Где вы живете? '))
print(input('Каков ваш рост? '))
print(input('Какое у вас хобби? '))
print(input('Какая ваша любимая еда? '))
print(input('Какое ваше любимое животное? '))
print(input('Где бы хотели жить? '))
print(input('Любимая игра? '))
print(input('Любимая книга? '))
